# Core development tools
brew "git"
brew "vim" 
brew "zsh"
brew "starship"

# Shell enhancements
brew "zoxide"          # Smart directory jumping
brew "fzf"             # Fuzzy finder
brew "eza"             # Better ls
brew "bat"             # Better cat
brew "ripgrep"         # Better grep
brew "fd"              # Better find
brew "delta"           # Git diff viewer
brew "lazygit"         # Terminal UI for git
brew "atuin"           # Magical shell history

# Zsh plugins
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-autosuggestions"
brew "autojump"

# Version managers
brew "nvm"

# Development tools
brew "node"
brew "python@3.11"
brew "go"
brew "docker"
brew "docker-compose"

# System tools
brew "htop"
brew "wget"
brew "curl"
brew "jq"             # JSON processor
brew "tree"           # Directory tree viewer
brew "stow"           # Dotfiles manager
brew "pygments"       # Syntax highlighting (required by common-aliases plugin)

